package com.example.pharmafiesta.ui.home.homescreen.firstaid

import androidx.compose.foundation.Image
import androidx.compose.foundation.clickable
import androidx.compose.foundation.layout.Arrangement
import androidx.compose.foundation.layout.Box
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.fillMaxSize
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.layout.size
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.foundation.shape.CircleShape
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.draw.clip
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.res.painterResource
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import androidx.navigation.NavHostController
import com.example.pharmafiesta.R

@Composable
fun  InstructionsScreenUI(navController: NavHostController) {

    Column(
        modifier = Modifier
            .fillMaxSize()
            .padding(16.dp)
    ) {

        Box(
            modifier = Modifier.fillMaxWidth()
        ) {
            Image(
                painter = painterResource(id = R.drawable.ic_arrow_back),
                contentDescription = "",
                modifier = Modifier
                    .size(24.dp)
                    .clip(CircleShape)
                    .align(Alignment.TopStart)
                    .clickable { navController.navigateUp() }
            )

        }

        LazyColumn(
            modifier = Modifier
            //  .fillMaxSize()
            //   .padding(16.dp)
        ) {
            item {
                Column(/*modifier = Modifier.fillMaxWidth(),*/
                    verticalArrangement = Arrangement.Center,
                    horizontalAlignment = Alignment.CenterHorizontally
                ) {
                    Image(
                        painter = painterResource(id = R.drawable.image_1),
                        contentDescription = null,
                        modifier = Modifier/*.size(40.dp)*/.padding(16.dp)
                    )

                    Text(
                        text = "* حالات الشرقان أو الغصة\n" +
                                "الغصة هي توقف مفاجئ في عملية التنفس نتيجة وجود جسم غريب أو قطعة من الطعام أسفل البلعوم أو أعلى الحنجرة ,مما يسبب انسداد مجرى الهواء والطعام ويكون رد الفعل الطبيعي لهذا أن يضع المصاب راحة يده حول عنقه ويشير مستنجداً طالبا المساعدة وقد تحدث الوفاة خلال 4-6 دقائق إذا لم يتم إسعافه وإخراج الجسم الغريب ويمكن للشخص المصاب أن يقوم بنفسه بمحاولة إخراج هذا الجسم.\n" +
                                "\n" +
                                "\n" +
                                "الأسباب المؤدية للغصة\n" +
                                "1- محاولة بلع قطع كبيرة من الطعام دون مضغها جيداً.\n" +
                                "2- استعمال أطقم أسنان صناعية فالأسنان الصناعية تجعل من الصعب الإحساس بحجم اللقم أثناء المضغ والبلع.\n" +
                                "3- التكلم بانفعال أو الضحك أثناء الأكل بسرعة.\n" +
                                "4- المشي أو اللعب أو الركض مع وجود أشياء داخل الفم.\n" +
                                "\n" +
                                "\n" +
                                "أنواع الغصة\n" +
                                "1- انسداد مجرى الهواء الجزئي:\n" +
                                "عندما يعاني المصاب من انسداد مجرى الهواء الجزئي فإنه يستطيع أن يسعل بقوة في محاولة لإزالة الجسم الذي يسد مجرى الهواء وقد يستطيع الكلام كما أنه يحاول التنفس محاولات مزعجة للاستنشاق تبدو بصوت عالٍ ويشبه الصفير، وقد يمسك المصاب عنقه دلالة على وجود جسم غريب يسد مجرى الهواء في هذه الحالة لا تتدخل وشجع المصاب على الاستمرار في السعال إذا استمر السعال اتصل بقسم الطوارئ فورا.\n" +
                                "\n" +
                                "2- انسداد مجرى الهواء الكلي :\n" +
                                "قد يتحول انسداد مجرى الهواء الجزئي إلى انسداد كلي لمجرى الهواء, وفي هذه الحالة لا يستطيع المصاب الكلام أو التنفس أو السعال وفي بعض الاحيان قد يسعل المصاب سعالا ضعيفا غير فعال وقد تصدر عن تنفسه أصوات حادة في هذه الحالة اطلب من احد المتواجدين الاتصال بقسم الطوارئ وابدأ فوراً بتقديم الإسعاف الأولي.\n" +
                                "\n" +
                                "\n" +
                                "الإسعافات الأولية\n" +
                                "1- (إذا كان المصاب واعيا) اسأله هل أنت غاص (شرقان) ؟\n" +
                                "\n" +
                                "فإذا كان يعاني من الغصة ابدأ فوراً بتقديم الإسعاف الأولي كما يلي:\n" +
                                "– اجعل المصاب ينحني للأمام.\n" +
                                "– اضغط أربع ضغطات بقبضة يدك تحت الصدر وفوق السرة على أن يكون اتجاه الضغط الى الاعلى وبسرعة في اتجاه الصدر.\n" +
                                "– استمر في ضغطات البطن بنفس الطريقة حتى يتحرك الجسم الغريب ويلقي به من الفم أو يبدأ المصاب في السعال.\n" +
                                "– عندئذ أوقف الضغطات وراقبه فقط.\n" +
                                "\n" +
                                "2- (إذا كان المصاب فاقدا للوعي):\n" +
                                "\n" +
                                "– حاول فتح مجرى الهواء وافحص التنفس فإن انعدم التنفس أعطه تنفسا اصطناعيا، فإذا وصل الهواء الى الرئتين (يعلو الصدر وينخفض) أعطه نفختين سريعتين.\n" +
                                "– ثم افحص النبض والتنفس، فإذا لم يصل الهواء إلى الرئتين اضغط أربع ضغطات على البطن وكرر العملية حتى يفتح مجرى الهواء وتخرج القطعة العالقة.\n" +
                                "– في حالة عدم الاستجابة قد تحتاج تنفسا اصطناعيا أو إنعاشاً كاملاً للقلب والرئتين إن لزم الأمر.\n" +
                                "\n" +
                                "\n" +
                                "حالات خاصة\n" +
                                "في بعض الحالات قد لا تستطيع لف ذراعيك حول بطن المصاب وذلك قد يكون بسبب سمنة زائدة عند المصاب أو كون المصاب امرأة حاملا فيكون الضغط على الصدر بالشكل التالي:\n" +
                                "\n" +
                                "– قف خلف المصاب ولف ذراعك تحت إبطيه وحول صدره.\n" +
                                "– ضع قبضة يدك من جهة الإبهام على وسط عظم صدر المصاب (عظمة القص).\n" +
                                "– أمسك قبضة يدك بيدك الأخرى.\n" +
                                "– اضغط على الصدر بشدة أربع مرات إلى أن يفتح مجرى الهواء.\n" +
                                "\n" +
                                "\n" +
                                "إذا كنت بمفردك وأصبت بغصة\n" +
                                "إذا أصبت بغصة ولا يوجد حولك من يساعدك فإنك تستطيع إجراء الضغطات البطنية لنفسك كما يلي:\n" +
                                "\n" +
                                "– ضع قبضة يدك من جهة الإبهام على أعلى البطن فوق السرة بقليل وتحت الطرف السفلي لعظمة الصدر (عظمة القص).\n" +
                                "– أمسك قبضة يدك بيدك الأخرى واضغط من 6-10 ضغطات قوية سريعة متتالية ليخرج الهواء من الرئتين دافعا معه الجسم المسبب للانسداد.\n" +
                                "– تستطيع كذلك الانحناء للأمام وضغط بطنك على حافة جسم ثابت مثل ظهر كرسي أو غيره عدة مرات متتالية مستخدما هذا الكرسي بديلاً عن قبضتي يدك.\n" +
                                "\n" +
                                "\n" +
                                "إذا كان المصاب طفلا أو رضيعا\n" +
                                "– يحمل الطفل على الذراع ووجهه الى الاسفل ورأسه في وضع منخفض عن صدره.\n" +
                                "– اضربه أربع ضربات على أعلى الظهر.\n" +
                                "– عدل وضع الطفل بحيث يكون مستلقيا على ظهره على فخذ المسعف وأسند رأسه بإحدى يديك.\n" +
                                "– اضغط بإصبعين بين السرة وأسفل القفص الصدري إلى الأعلى أربع ضغطات قوية.\n" +
                                "– افتح فم الطفل لرؤية أي جسم غريب وأزل كل ما تراه في الفم.\n" +
                                "\n" +
                                "*حالات النزيف\n" +
                                "النزيف هو خروج الدم من الأوعية الدموية قليلا كان أم كثيرا , و يسمى خارجيا إذا كان خارج الجسم , و يسمى داخليا إذا كان في أحد تجاويف الجسم المختلفة.\n" +
                                "\n" +
                                "\n" +
                                "أنواع النزيف\n" +
                                "النزيف الشريانى و هو أشد خطرا , و يكون لون الدم فيه أحمر فاتح و يخرج بغزارة ، و يكون متقطعا مع ضربات القلب و باندفاع قوي.\n" +
                                "\n" +
                                "النزيف الوريدى و هو يخرج في تيار بطيء ، و يكون لون الدم أحمر غامق لتشبعه بثاني أكسيد الكربون.\n" +
                                "\n" +
                                "النزيف الشعرى و هو أقل خطرا و يخرج بانسياب بطيء ، و يكون لون الدم أحمر أرجواني و قد يظهر على هيئة نقط دموية صغير.\n" +
                                "\n" +
                                "النزيف الداخلى و هو إما يكون تحت الجلد أو يكون مختبئا داخل الأعضاء أو أحد تجاويف الجسم المختلفة مثل نزيف الجمجمة و غيرها.\n" +
                                "\n" +
                                "الأعراض و العلامات العامة\n" +
                                "1 خروج الدم إذا كان الجرح مفتوحا\n" +
                                "2 ظهور ورم دموي في مكان الإصابة\n" +
                                "3 برودة في الجسم - تعرق الجسم - شحوب الوجه - زرقة الشفاه و الأذنين و الجفون\n" +
                                "4 سرعة معدل التنفس مصحوبا بشهيق\n" +
                                "5 سرعة النبض - انخفاض ضغط الدم - العطش الشديد\n" +
                                "\n" +
                                "الإسعافات الأولية\n" +
                                "إيقاف النزيف الخارجي\n" +
                                "\n" +
                                "1 الضغط المباشر على الجرح النازف بغيار نظيف\n" +
                                "2 رفع العضو المصاب إلى أعلى إن لم يكن به كسر\n" +
                                "3 يربط الضمادة جيدا بينما يظل العضو مرفوعا\n" +
                                "4 قد يصبح الغيار مشبعا بالدم فلا تغيره أبدا و لا تنزعه\n" +
                                "5 يمكن وضع غيار ثاني على الغيار الأول و يربط بضغط\n" +
                                "6 مراقبة المصاب من حدوث الصدمة\n" +
                                "7 ينقل المصاب إلى أقرب مركز طبي\n" +
                                "8 لا تستخدم البن أو ما شابه لإيقاف النزيف\n" +
                                "\n" +
                                "نقاط الضغط\n" +
                                "\n" +
                                "تستخدم في حالة النزيف الشديد و تطبق بالضغط على الشريان الرئيسي المغذي للعضو المصاب و هى :\n" +
                                "\n" +
                                "1 الشريان الذراعي : يضغط على منتصف السطح الداخلي بعظم العضد و ذلك في حالات جرح الساعد و المرفق و اليد\n" +
                                "\n" +
                                "2 الشريان الفخذي : يضغط عليه مع حافة عظم الحوض عند زاوية الفخذ و ذلك في حالات نزيف الأطراف السفلية\n" +
                                "\n" +
                                "الرباط الضاغط أو ما يسمى ( التورنكيت )\n" +
                                "\n" +
                                "إن استعمال الرباط الضاغط له مضاعفات خطيرة لما يتطلب من عناية خاصة ، و لكن في الحالات الخاصة التي يوجد بها مصابون كثيرون بينما لا يوجد سوى مسعف واحد أو وجود نزيف شديد نتيجة قطع أكثر من شريان أو قطع جزئي أو كلي لأحد الأطراف حيث يفيد استعماله في هذه الحالات لإيقاف النزيف بأسرع وقت ممكن.\n" +
                                "\n" +
                                "وللقيام بذلك يلف الرباط المثلث على شكل شريط , ثم تربط حول العضو المصاب بالقرب من الجرح بين مكان النزيف و القلب ، و تستخدم قطعة خشبية لزيادة الشد عليها.\n" +
                                "                   صورة\n" +
                                "عند استعمال الرباط الضاغط يجب مراعاة التالي\n" +
                                "\n" +
                                "1 لا يرفع الضغط إلا بعد تثبيت الرباط الضاغط\n" +
                                "\n" +
                                "2 يمكن الاستعانة بكثير من المواد لاستعمالها مثل المنديل و الحزام و الفوطة و الغترة و الإيشارب\n" +
                                "\n" +
                                "3 أن يرخي الرباط الضاغط بعد كل نصف ساعة و لمدة ثواني حتى نسمح للدم بإكمال دورته فى الطرف المصاب و حتى تتغذى الأنسجة الدموية فى الطرف المصاب ، و لا تحاول فكها بشكل كامل و دع ذلك للجهاز الطبي المختص\n" +
                                "\n" +
                                "4 ألا تغطي الرباط الضاغط ( بالملابس وغيرها ) حتى يتمكن الطبيب المعالج من رؤيته عند وصول المصاب\n" +
                                "\n" +
                                "5 ألا تستعمل الأسلاك و الخيوط الرفيعة أو أي شيء يمكن أن يحز في الجسم و يؤذي المصاب\n" +
                                "\n" +
                                "6 يجب أن توضح الوقت و الزمن الذي تم فيها وضع الرباط الضاغط\n" +
                                "\n" +
                                "7 إن أمكن قرّب حافتى الجرح إحداهما من الأخرى بالضغط عليهما جيدًا بالإبهام من جهة و باقى الأصابع من جهة أخرى و ذلك إن لم يتواجد الرباط و هذا يتطلب الضغط لفترة طويلة\n" +
                                "\n" +
                                "8 ليكن المصاب مستلقيًا أفقيًا فى حالة الإصابة مع رفع الجزء المصاب إلى أعلى ( الرجل أو الزراع مثلاً ) ليقل تدفق الدم بتقليل فعل الجاذبية الأرضية ، و بعد توقف النزيف لا تنزع الرباط و ضمد الجرح جيدًا فوق الرباط.\n" +
                                "\n" +
                                "الإسعاف الأولي للنزيف الداخلي\n" +
                                "\n" +
                                "1 إذا كانت الإصابة بسيطة ضع عليها ثلجا أو كمادة باردة للمساعدة في تخفيف الألم و التورم ، و ضع قطعة قماش بين الثلج و جلد المصاب لمنع تلف الجلد\n" +
                                "\n" +
                                "2 اجعل المصاب يستلقي على جانبه متكئا على إحدى يديه و يثني ركبتيه للمساعدة في خروج القيء إن وجد\n" +
                                "\n" +
                                "3 حافظ على درجة حرارة الجسم الطبيعية بتغطية المصاب\n" +
                                "\n" +
                                "4 كما يجب تهدئة المصاب و بعث الطمأنينة في نفسه\n" +
                                "\n" +
                                "5 لا تقدم للمصاب أي طعام أو شراب\n" +
                                "\n" +
                                "6 إذا كان فاقدا للوعي أفحص التنفس و إذا لزم الأمر أنعش تنفسه.\n" +
                                "\n" +
                                "*حالات الكسور\n" +
                                "الكسر هو انقسام أو شرخ في العظم يحدث نتيجة صدمة قوية أو مفاجئة تقع على العظم كما في حالات حوادث الطرق أو السقوط.\n" +
                                "\n" +
                                "\n" +
                                "كيف تعرف أن الإصابة هي حالة كسر؟\n" +
                                "- إحساس المصاب بألم شديد\n" +
                                "- شكل غير عادي للطرف المكسور\n" +
                                "- انتفاخ منطقة الإصابة والإحساس بالألم عند لمسها\n" +
                                "- حركة غير عادية في الطرف المكسور\n" +
                                "\n" +
                                "أنواع الكسور\n" +
                                "- كسور بسيطة (مغلقة): وهي الكسور التي ينكسر بها العظم دون أن يسبب جرحاً أو تلفاً في الجلد مفتوحاً للخارج .\n" +
                                "\n" +
                                "- كسور مضاعفة (مفتوحة): وهي الكسور التي يبرز بها العظم من الجلد مع تمزق الأنسجة المحيطة بالعظم، وهي أخطر من الكسور المغلقة لأنه يرافقها خطر حدوث التهاب أو نزيف من الجرح.\n" +
                                "\n" +
                                "- الخلع: هو خروج أو انفصال العظم من موضعه الطبيعي في المفصل.\n" +
                                "\n" +
                                "- الالتواء المفصلي: وهو التمزق الجزئي أو الكلي للأربطة والأنسجة المحيطة بالمفصل.\n" +
                                "\n" +
                                "- الشد العضلي: هو تمزق في ألياف العضل ينتج عادة من رفع ثقل كبير بوضع غير صحيح، ويحدث عادة في العنق أو الظهر ويكون مؤلماً جداً.\n" +
                                "\n" +
                                "الأعراض والعلامات\n" +
                                "- ألم شديد في موضع الإصابة عند أقل حركة.\n" +
                                "\n" +
                                "- عجز العضو المصاب عن أداء وظيفته المعهودة.\n" +
                                "\n" +
                                "- قصر طول الطرف المصاب.\n" +
                                "\n" +
                                "- وجود حركة أو صوت فرقعة غير طبيعي عند تحرك العظام المكسورة.\n" +
                                "\n" +
                                "- حدوث نزف أو جرح في الكسور المضاعفة.\n" +
                                "\n" +
                                "- تورم مكان الإصابة مع تغير لون الجلد.\n" +
                                "\n" +
                                "الإسعافات الأولية\n" +
                                "قواعد عامة\n" +
                                "\n" +
                                "- يتم التعامل مع الإصابات التي يشك بكونها كسوراً وكأنها كسور فعلاً حتى يثبت العكس.\n" +
                                "\n" +
                                "- كسور العظام الكبيرة مثل عظم الفخذ أو الحوض قد تؤدي إلى نزف شديد وإصابة المريض بهبوط الضغط والصدمة وقد تؤدي للوفاة ولذلك يجب إسعافه بسرعة إلى أقرب مستشفى وتعويضه بنقل الدم أو المحاليل الوريدية.\n" +
                                "\n" +
                                "- من الصعب على غير المختص معرفة نوع الكسر على وجه التحديد لذلك يجب العناية بإصابة مريض الكسور كما يلي:\n" +
                                "\n" +
                                "\n" +
                                "1 ضع المريض في أكثر الأوضاع راحة بالنسبة له.\n" +
                                "\n" +
                                "2 تقليل الحركة ما أمكن وخاصة حركة العنق ويجب لفعل ذلك تثبيتها بداعمة من البلاستيك تلف حول الرقبة لمنع تحركها، حيث إن تحرك الكسر قد يؤدي إلى تمزيق الأنسجة والجلد وتحويل الكسر من كسر بسيط مغلق إلى كسر مضاعف مفتوح.\n" +
                                "\n" +
                                "3 حاول إيقاف النزيف إن وجد بوضع ضماد معقم على مكان النزف، لكن لا تحاول تنظيف الجرح الناتج عن الكسر.\n" +
                                "\n" +
                                "4 ثبت العضو المصاب على جبيرة لمنع حركته، ويمكنك استعمال عصا أو لوح خشبي أو عصا المكنسة أو قطعة من الكرتون أو الورق المقوى، كما يمكن استخدام القماش أو القطن بين الجبيرة أو لوح الخشب وبين الجلد لعمل بطانة ناعمة للجبيرة حول الطرف المصاب.\n" +
                                "\n" +
                                "5 إذا لم تتوفر مواد لاستعمالها في التجبير فيمكن تثبيت الطرف المصاب بضمه إلى طرف آخر مجاور، وكمثال يمكن ضم الذراع إلى الصدر أو ضم الساق المكسورة إلى الساق السليمة.\n" +
                                "\n" +
                                "6 إذا كانت الإصابة كسراً مغلقاً أو خلعاً أو التواءً في مفصل أو شداً عضلياً، فيمكن وضع كمادة باردة أو مثلجة على مكان الإصابة لتقليل حدوث التورم الدموي.\n" +
                                "\n" +
                                "7 استدع الإسعاف فوراً لنقل المصاب إلى المستشفى وعمل الأشعة السينية لمكان الكسر.\n" +
                                "إصابات الرأس والعنق والظهر\n" +
                                "إصابة الرأس والعنق والظهر (العمود الفقري) هي من الإصابات الخطيرة عموماً والتي يصعب العناية بها لغير المختص، وتحدث غالباً في الحوادث العرضية مثل السقوط وحوادث السيارات.\n" +
                                "\n" +
                                "- إذا كان ثمة اشتباه في وجود إصابة بالعمود الفقري، فيجب تثبيت رأس المصاب وعنقه بوضع اليدين على كلا جانبي رأس المصاب، فهذا يجعل الرأس على مستوى واحد مع العمود الفقري ويحدد حركته.\n" +
                                "\n" +
                                "- إذا كان من الضروري تحريك المصاب فيمكن تحريكه برفق دون تغيير وضع الجسم قدر الإمكان، ومن الممكن سحبه من ملابسه كالتالي:\n" +
                                "\n" +
                                "- إذا كنت بمفردك وكنت تشتبه في وجود إصابة في العمود الفقري فاستعمل طريقة السحب من الملابس.\n" +
                                "\n" +
                                "- إذا كان المصاب ضخم الجسم فيمكن استعمال طريقة السحب من القدمين.\n" +
                                "\n" +
                                "تذكّــر\n" +
                                "- لا تحرك المصاب إلا للضرورة\n" +
                                "- استخدم الرباط الضاغط لوقف النزف\n" +
                                "- اربط الذراع إلى العنق برباط مثلث\n" +
                                "- استخدم الطرف السليم لتثبيت الطرف المكسور\n" +
                                "- أفضل وسيلة على الإطلاق لتخفيف الألم هي تثبيت الكسر بواسطة التجبير\n" +
                                "\n" +
                                "- تجبير الكسر بما هو متاح هو دوماً خيار أفضل من ترك الكسر دون تثبيت\n" +
                                "                           صورة\n" +
                                "\n" +
                                "1 كسر وخلع الكتف والعَضُد: ضع علاقة بحيث يكون الكوع زاوية قائمة.\n" +
                                "\n" +
                                "2 كسر الساعد واليد: استعمل الجبائر الهوائية وانتبه أن تكون اليد بالكامل داخلة في الجبيرة.\n" +
                                "\n" +
                                "3 كسر الحوض: استعمل بنطلون الصدمة أو النقالة الخشبية.\n" +
                                "\n" +
                                "4 كسر الفخذ: استعمل الجبيرة الهوائية أو جبيرة الشد (المربوطة مع بعض الأثقال إلى القدم بحيث تبقي الفخذ مشدوداً وطرفي الكسر غير متداخلين) أو أي جبيرة متوفرة.\n" +
                                "               صورة\n" +
                                "1 كسر الساق: استعمل الجبيرة الهوائية أو جبيرة الشد أو أي جبيرة، ويمكنك ربط الساق المكسورة إلى الساق السليمة.\n" +
                                "\n" +
                                "2 كسور الكاحل والقدم: استعمل الجبيرة الهوائية مع مراعاة أن تكون القدم بالكامل داخل الجبيرة.\n" +
                                "\n" +
                                "3 كمثال: إذا كسرت ذراعك يمكنك إحضار مجلة وثنيها على شكل حرف النون لكي تحيط بالذراع المكسورة ثم لفها بأي لاصق أو بقطعة من القماش لتثبيت الجزء المكسور لحين الذهاب إلى المستشفى.\n" +
                                "\n" +
                                "*التنفس الاصطناعي\n" +
                                "التنفس الاصطناعي هو عملية تنفس ميكانيكية لاستعادة وضع الرئتين عند توقف أو اضطراب التنفس يجب على كل إنسان التدريب على إجراء التنفس الصناعي فقد يضطر لإنقاذ حياة مصاب و يجب أن يعلم أنه في حالة توقف التنفس لا يعيش المصاب أكثر من 4 إلى 6 دقائق ، و كلما كان الإسعاف أسرع كلما قل التلف في أنسجة المخ بسبب نقص الأوكسجين.\n" +
                                "\n" +
                                "\n" +
                                "الأسباب المؤدية لتوقف التنفس :\n" +
                                "الغرق – الاختناق – الصدمة الكهربائية – الإفراط في تناول بعض الأدوية و خصوصا المهدئات و المخدرات – النوبة القلبية – إصابات الرأس و الصدر\n" +
                                "\n", fontSize = 16.sp, color = Color.Gray, modifier = Modifier
                            .fillMaxWidth()
                            .padding(16.dp)
                    )


                    Text(
                        text =
                        "و فى التنفس الاصطناعي يتم نقل الهواء من رئتي المسعف إلى رئتي المصاب بالنفخ فيهما عن طريق الفم و هذا الزفير يحتوي على %16 من الأوكسجين وهو أكثر مما يحتاج إليه للحفاظ على الحياة و هذا هو التنفس فماًً لفم\n" +
                                "\n" +
                                "التنفس الاصطناعي عن طريق ( الفم للفم ) هي الطريقة المفضلة في جميع الحالات التي لا يتنفس فيها المصاب ، و إذا تعذر الفم يمكن استخدام الأنف أو الفم و الأنف معاً\n" +
                                "\n" +
                                "ملاحظة : قد يتعذر هذا التنفس في حال وجود جروح بليغة جداً أو وجود مادة آكلة حول الفم ، و لا جدوى من التنفس الاصطناعي إذا كان قلب المصاب لا يخفق لأن الدم المؤكسد لن يدور في الجسم فبعد إجراء التنفس الاصطناعي مرتين يجب التأكد أن القلب ينبض ، و إذا كان القلب لا ينبض يمكن تنبيه الانقباض في القلب عن طريق عملية الإنعاش القلبى الرئوى\n" +
                                "\n" +
                                "الإسعافات الأولية\n" +
                                "قياس مدى درجة الوعي عند المصاب\n" +
                                "\n" +
                                "إذا كان المصاب واعيا لما حوله أو يستجيب عند النداء عليه أو عند هز كتفه فهذا يعني أن جهاز التنفس يعمل و أن قلبه ينبض فلا داعي لإجراء التنفس الصناعي أو إنعاش قلبه.\n" +
                                "\n" +
                                "و لكن يجب ملاحظته باستمرار للتأكد من حفاظه على درجة الوعي و التنفس و عمل القلب إلى أن تصل الإسعاف\n" +
                                "\n" +
                                "طريقة ملاحظة التنفس\n" +
                                "\n" +
                                "يُقلب المصاب على ظهره بحيث يصبح وجهه إلى أعلى ، ثم يقوم الشخص المسعف بإجراء عملية النظر و الإصغاء و التحسس:\n" +
                                "\n" +
                                "1 ينظر إلى صدر الشخص و بطنه : هل يرتفعان و يهبطان بتواتر ؟\n" +
                                "\n" +
                                "2 ثم توضع أذن المسعف على مقربة من فم المصاب و أنفه : هل يُسمع صوت تردد أنفاس المصاب ؟\n" +
                                "\n" +
                                "1.1 إذا كان يتنفس و لكنه غير واع تماما فيمكنك وضعه في الوضع الجانبي الثابت و هو وضع مناسب في حالة تقيؤ المصاب و لضمان فتح مجرى التنفس عنده ( هذا الوضع غير مناسب في حالة إصابات العنق ).\n" +
                                "\n" +
                                "2.2 إذا كان المصاب غير واع أو لا يستجيب للمؤثرات كما سبق شرحه ، في هذه الحالة يجب التأكد من تحرير مجرى الهواء خوفا من سقوط اللسان و قفل مجرى التنفس مع إزالة أي شيء داخل الفم مثل طاقم الأسنان أو القيء و يمكن تحرير مجرى الهواء برفع الرأس من ذقن المصاب برفق إلى الأعلى ، و عاين التنفس كما ذكرنا سابقا بالنظر لصدر المصاب و اسمع و تحسس التنفس.\n" +
                                "\n" +
                                "طريقة التنفس الصناعي\n" +
                                "1 أمل رأس الشخص إلى الوراء بحيث تتجه ذقنه إلى أعلى و ذلك لإبقاء المسالك التنفسية مفتوحة ، و يتم تفريغ الفم من كل شيء فيه حتى الأسنان الصناعية\n" +
                                "\n" +
                                "2 باليد اليسرى نغلق فتحتى الأنف تماما و نجذب الرأس إلى الوراء\n" +
                                "\n" +
                                "3 و باليد اليمنى نبق الذقن متجهًا إلى أعلى\n" +
                                "\n" +
                                "4 افتح فم المصاب و أطبق فمك عليه بإحكام\n" +
                                "\n" +
                                "5 خذ زفيراً و انفخه في فم المصاب بعمق لمدة ثانية واحدة أو ثانية و نصف ثم توقف عن الزفير لنفس المدة\n" +
                                "\n" +
                                "6 إذا لاحظت ارتفاعاً و انخفاضاً في صدر المصاب أثناء عملية النفخ\n" +
                                "\n" +
                                "7 فكرر عملية النفخ مرة كل خمس ثوانى\n" +
                                "\n" +
                                "8 كل مرتين راقب تنفس المصاب إلى حين وصول فرقة الإسعاف المهني\n" +
                                "\n" +
                                "9 يكون طول النفس فى حالة إعطاء تنفس صناعى للشخص البالغ (أخذ نفس عميق و نفخه) ٬ و إذا كان المصاب طفل يكون طول النفس (ما هو متواجد فى رئة المسعف) ٬ أما إذا كان رضيعا فيكون (نفخة بسيطة).\n" +
                                "\n" +
                                "10 حالما يستعيد المصاب تنفسه أقلب المصاب فى اتجاهك لوضع المصاب فى وضع الإفاقة ، و لا نتركه وحده بأى حال من الأحوال إذ قد يتوقف التنفس مرة أخرى\n" +
                                "\n" +
                                "11 أما في حال لا يوجد علو في صدر المصاب أثناء النفخ هذا يعني أن هناك انسداد في مجرى الهواء ، أدخل إصبعك في الفم لاستخراج ما قد يكون مسببا لذلك ثم تابع عملية الإنعاش\n" +
                                "\n" +
                                "طريقة ملاحظة النبض\n" +
                                "- بعد ذلك تفحص نبض الشخص عن طريق جس أعلى عنقه ٬ حيث بوضع إصبعين (السبابة و الوسطى) على رقبة المصاب من اليمين أو من اليسار.\n" +
                                "\n" +
                                "- فإذا لم تتحسس نبض المصاب فيجب التحول فورا إلى طريق عملية الإنعاش القلبى الرئوى.\n" +
                                "\n" +
                                "\n" +
                                "*إنعاش القلب والرئتين\n" +
                                "\n" +
                                "إن توقف النبض و اتساع حدقة العين من أولى علامات توقف القلب حيث يلزم القيام بعملية إنعاش (تدليك) للقلب فورا.\n" +
                                "\n" +
                                "الأعراض و العلامات\n" +
                                "\n" +
                                "الشخص المنقطع الأنفاس يكون متمدداً ساكناً ، و قد يصطبغ وجهه و شفتاه باللون الرمادي أو الأزرق.\n" +
                                "\n" +
                                "الإسعافات الأولية\n" +
                                "\n" +
                                "في حالة عدم وجود النبض على جانب الرقبة عند الشريان ألسباتي , يجب البدء فورا بإنعاش القلب , و ذلك يكون بضربة واحدة سريعة من اليد على منتصف القفص الصدري.\n" +
                                "\n" +
                                "هذه الضربة يجب أن تكون خلال الدقيقة الأولى من الأزمة القلبية ، و إن لم تكن هذه الضربة كافية لاستجابة القلب فعليك البدء في عملية الإنعاش و ذلك كالتالى:\n" +
                                "\n" +
                                "1 يوضع المصاب على سطح مستوي و صلب ، و نجلس على ركبتينا على يمين المصاب.\n" +
                                "\n" +
                                "2 نفرد اليد اليمنى للمصاب لتصنع زاوية قائمة مع جسمه.\n" +
                                "\n" +
                                "3 يحدد موقع مؤخرة عظمة القص (عظمة منتصف الصدر) و يؤخذ عرض إصبعين منه ثم يضغط بعقب اليد بزاوية عمودية بحيث ينخفض الصدر3 إلى 5 سم.\n" +
                                "\n" +
                                "4 غط هذه اليد بكفة اليد الأخرى ثم شابك أصابعك على أن تكون كتفاك فوق عظم قص المصاب وذراعاك مستقيمتين.\n" +
                                "\n" +
                                "            صورة \n" +
                                " يجب القيام بعملية إنعاش التنفس بجانب إنعاش القلب.\n" +
                                "\n" +
                                "6 لعمل التنفس الاصطناعي (منقذ واحد) يكون المعدل أن نضغط على صدر المريض خمس عشرة مرة بسرعة ثم نعطية نفسين (15 / 2.\n" +
                                "\n" +
                                "7 أما إذا كان مسعف آخر معك (منقذين) فيكون المعدل أن نضغط على صدر المريض خمس مرات بسرعة ثم نعطية نفس واحد (5 / 1.\n" +
                                "\n" +
                                "8 بعدها تحقق من النبض كل ثلاث دقائق ، و بمجرد عودة النبض كف عن الضغط حالاً و واصل التنفس فماً لفم حتى يعود التنفس طبيعياً .\n" +
                                "\n" +
                                "9 ما لو لم يعود النبض أو التنفس فيجب الاستمرار في إنعاش القلب و الرئتين حتى يستعيد المصاب نبضه و نفسه أو حتى تصل سيارة الإسعاف.\n" +
                                "\n" +
                                "نقاط هامة\n" +
                                "1 البدء أولا بالتنفس ثم الضغط (يجب غلق أنف المصاب لإتمام عملية التنفس الصناعى بشكل صحيح)\n" +
                                "\n" +
                                "2 لا توقف عملية الإنعاش لأكثر من خمس ثوان.\n" +
                                "\n" +
                                "3 سرعة الضغط لمنقذ واحد 80 ضغطة في الدقيقة , و 60 ضغطة في الدقيقة في حالة وجود منقذين.\n" +
                                "\n" +
                                "4 يجب أن يكون الضغط بلطف و انتظام على أن يكون الضغط بعقب اليد و ليس براحة اليد , و تكون الأصابع بعيدة عن صدر المصاب حتى لا تؤدى إلى إصابة الأضلاع.\n" +
                                "\n" +
                                "5 عند الأطفال يكون معدل الضغط خمس ضغطات و نفس واحد بسرعة 80 إلى 100 ضغطة في الدقيقة (5 / 1 ، (و يكون الضغط في منتصف الصدر بعقب يد واحدة.\n" +
                                "\n" +
                                "6 أما الرضيع فيكون معدل الضغط خمس ضغطات و نفس واحد بسرعة 100 ضغطة في الدقيقة (5 / 1 ، (و يكون الضغط بإصبعين فقط على منتصف الصدر بين الحلمتين , و يفحص نبض الرضيع على منتصف الصدر أو عند منتصف الذراع.\n" +
                                "\n" +
                                "7 إذا أفاق المصاب أجلسه في وضع الإفاقة ، بعدها تجد وجه المصاب و شفتيه قد تحسن لونهما و يتغير من اللون الأزرق إلى اللون الزهري لأن الدم المحتوي على الأكسجين يبدأ بالدوران، لأن الدم المحتوي على الأكسجين يبدأ بالدوران.\n" +
                                "\n" +
                                "8 يكون طول النفس فى حالة إعطاء تنفس صناعى للشخص البالغ (أخذ نفس عميق و نفخه) ، و إذا كان المصاب طفل يكون طول النفس (ما هو متواجد فى رئة المسعف) ، أما إذا كان رضيعا فيكون (نفخة بسيطة).\n" +
                                "\n" +
                                "*حالات الاختناق\n" +
                                "الاختناق هو عدم توافر الأكسجين و ذلك قد يكون في الأبنية التي تمتلئ بالغاز أو الدخان أو قد يكون بالتسمم بأول أكسيد الكربون أو السيانيد مثلاً.\n" +
                                "\n" +
                                "يتعرض الشخص للاختناق باستنشاق مواد غازية مثل غاز أول أكسيد الكربون من عوادم السيارات , أو الحرائق , أو شوايات الفحم , أو غاز المطبخ , أو الغازات المستخدمة في المصانع , أو الغرق.\n" +
                                "\n" +
                                "يحدث الاختناق عندما لا يتوفر الأكسجين لأنسجة الجسم بكمية كافية ، و ذلك في الحالات التالية :\n" +
                                "\n" +
                                "1 انسداد مسلك الهواء عن طريق سقوط اللسان إلى الجزء الخلفي للحلق لدى المريض الفاقد للوعي.\n" +
                                "\n" +
                                "2 انسداد مسلك الهواء بسبب وجود طعام أو قيء.\n" +
                                "\n" +
                                "3 وجود سائل في مسالك الهواء.\n" +
                                "\n" +
                                "4 إنضغاط القصبة الهوائية نتيجة الشنق أو الخنق.\n" +
                                "\n" +
                                "5 إنضغاط الصدر الناجم عن انهيار تراب أو انهراسه بواسطة حائط أو ضغطه من قبل حشد من الناس (فى حالات الزحام).\n" +
                                "\n" +
                                "6 صابة الرأس أو إصابة جدار الصدر.\n" +
                                "\n" +
                                "7 الحالات التي توثر على الدماغ أو الأعصاب التي تتحكم في التنفس و منها المس الكهربائي و التسمم و الشلل الناتج عن السكتة الدماغية.\n" +
                                "\n" +
                                "الأعراض و العلامات العامة\n" +
                                "قد تظهر واحدة أو أكثر أو جميع العلامات التالية :\n" +
                                "\n" +
                                "1 الدوخة.\n" +
                                "\n" +
                                "2 الصداع.\n" +
                                "\n" +
                                "3 صعوبة التنفس الذى يكون مصاحبا بصوت من الشخير أو القرقرة.\n" +
                                "\n" +
                                "4 شحوب أو زرقة لون الجلد (خاصة الوجه و الشفتين).\n" +
                                "\n" +
                                "5 فقدان الوعي.\n" +
                                "\n" +
                                "الإسعافات الأولية\n" +
                                "1 اتصل بالإسعاف.\n" +
                                "\n" +
                                "2 نقل المصاب إلى مكان تتوفر فيه تهوية طبيعية (أزل سبب الاختناق و افتح مسالك الهواء).\n" +
                                "\n" +
                                "3 ابدأ بإجراء الفحص المبدئي :\n" +
                                "\n" +
                                "3.1 مجرى الهواء و التنفس (تحقق من فتح مسالك الهواء من الفم و الأنف).\n" +
                                "\n" +
                                "3.2 تحقق من معدل التنفس.\n" +
                                "\n" +
                                "4 إذا كان طفل مختنق من وسادة نغير وضع الطفل سريعاً.\n" +
                                "\n" +
                                "5 كن مستعدا لإعطاء إنعاش القلب و الرئتين إذا لزم.",
                        fontSize = 16.sp,
                        color = Color.Gray,
                        modifier = Modifier
                            .fillMaxWidth()
                            .padding(16.dp)
                    )


                }
            }
        }
    }
}