package com.example.pharmafiesta.ui.home.homescreen.firstaid

import androidx.compose.foundation.Image
import androidx.compose.foundation.layout.Arrangement
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.res.painterResource
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import com.example.pharmafiesta.R

@Composable
fun  SwallowTheTongueScreenUI () {
    LazyColumn(
    ) {
        item {
            Column(
                verticalArrangement = Arrangement.Center,
                horizontalAlignment = Alignment.CenterHorizontally) {
                Image(painter = painterResource(id = R.drawable.image_2), contentDescription = null, modifier = Modifier/*.size(40.dp)*/.padding(16.dp))
                Text(text = "حالة بلع اللسان\n" +
                        "\n" +
                        "انتشرت في السنوات الأخيرة في الملاعب الرياضية حالة و ظاهرة خطيرة و هي ظاهرة بلع اللسان من قبل اللاعب ، و كانت هناك حالات وفاة كثيرة بسبب هذه الحالة الخطيرة ، و أغلبها تكون بسبب عدم معرفة كيفية إسعاف المصاب بهذه الحالة.\n" +
                        "\n" +
                        "و بلع اللسان هي حالة مرضية و عرض ناتج عن خلل في الجهاز العصبي يحدث مفاجئا و مصحوبا باختلاجات عصبية و فقدان الوعي و الذاكرة المؤقت.\n" +
                        "\n" +
                        "ما هي حقيقة بلع اللسان ؟\n" +
                        "\n" +
                        "إن ما يسمى ببلع اللسان هو تعبير خاطئ و أمر من المستحيل حدوثه ، لأن الإنسان لا يمكنه أن يبلع لسانه ، و لذا من الخطأ إدخال اليد لسحب اللسان للأسباب التالية :\n" +
                        "\n" +
                        "- لأن عضلة اللسان قوية و لا يمكن تحريكها أو سحبها بسهولة.\n" +
                        "\n" +
                        "- لأن الفك يكون متشنجا فيصعب فتحه لتحريك اللسان.\n" +
                        "\n" +
                        "- لأن اللعاب (السائل الزلق الموجود بالفم) لا يساعد على التحكم فى الإمساك باللسان\n" +
                        "\n" +
                        "كيف يبتلع الإنسان لسانه ؟\n" +
                        "\n" +
                        "عنما يفقد الإنسان الوعي ترتخى عضلات الجسم كله , بما في ذلك عضلات الفك و عضلة اللسان و كذلك لسان المزمار . فتسقط قاعدة اللسان في مجرى الهواء (إلى الخلف) و تسده ، مما يسبب انسداد مجرى الهواء و حالة من الاختناق\n" +
                        "\n" +
                        "أسباب بلع اللسان\n" +
                        "\n" +
                        "1 إصابات أو ضربات الرأس و ارتجاج الدماغ كلها عوامل تؤدي إلى خلل في وظيفة الدماغ و زيادة في التحفيزات الكهربائية للدماغ و خلل عصبى مما يؤدى بدوره إلى ما يسمى بحالة بلع اللسان.\n" +
                        "\n" +
                        "2 حالات القصور في الدورة الدموية مثل حالة الارتجاف الأذيني Fibrillation Atrial قد تؤدى إلى ما يسمى بحالة بلع اللسان.\n" +
                        "\n" +
                        "3 جميع الحالات المرضية التى قد تسبب فقدان الوعى أو الغيبوبة.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "\n" +
                        "1 إمالة الرأس إلى الخلف و الضغط على الفك السفلي مع محاولة دفع زاوية الفك الأمامي ، مما يؤدى إلى عودة اللسان إلى وضعه الطبيعي.\n" +
                        "\n" +
                        "2 على المسعف أن يقوم بإمالة الرأس للخلف و جعل الذقن في أعلى مستوى ، ثم يتبع ذلك فتح الفم و تحريك تحريك الفك السفلي للأسفل ، ثم يخرج اللسان بطريقة السحب حيث توضع الأصابع (السبابة و الإبهام) خلفه على شكل خطاف و يشد للخارج.\n" +
                        "            صورة\n" +
                        "\n" +
                        "3 في حال صعوبة الإرجاع يجب إدخال أنبوب للتنفس Tube Endotracheal للمساعدة على التنفس حتى تنفرج المشكلة.\n" +
                        "\n" +
                        "4 يفضل استخدام عصا أو أداة لتقليب اللسان بدل من استخدام الأصابع ، فهي الطريقة الأكثر أمنا للمسعف ، فربما المريض قد يطبق فمه على المسعف و يقطع أصابعه نظرا لتشنج عضلات الفك\n" +
                        "\n" +
                        "5 كما يفضل نقل المصاب إلى المستشفى على أن يوضع في غرفة العناية المركزة لأنه قد يحتاج إلى إنعاش قلبي رئوي بما في ذلك صدمات كهربائية للقلب في حالة وجود رجفان في القلب أو قصور في الدورة الدموية.\n" +
                        "\n" +
                        "*حالات السكتة الدماغية (جلطة فى المخ)\n" +
                        "السكتة الدماغية تسمى أحيانا جلطة في المخ وهي عبارة عن عدم حصول المخ على الكمية اللازمة من الأكسجين بسبب جلطة دموية أو تمزق فى أحد الأوعية الدموية داخل المخ.\n" +
                        "\n" +
                        "أسباب السكتة الدماغية\n" +
                        "1 الجلطة (التخثر أو الانسداد) التي تتكون في شريان الدماغ أو يحملها الدم إلى الدماغ.\n" +
                        "\n" +
                        "2 تمزق شريان في الدماغ نتيجة إصابة بالرأس أو ارتفاع ضغط الدم أو وجود ضعف في جدار أحد الأوعية الدموية.\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "1 ضعف وتخدر الوجه أو الذراع أو الساق و غالبا ما يكون ذلك في أحد جانبي الجسم.\n" +
                        "\n" +
                        "2 دوخة و ارتباك و صداع شديد.\n" +
                        "\n" +
                        "3 سماع أصوات (طنين في الأذنين).\n" +
                        "\n" +
                        "4 صعوبة و تلعثم في الكلام\n" +
                        "\n" +
                        "5 صعوبة في التنفس.\n" +
                        "\n" +
                        "6 اختلاف حجم بؤبؤي العينين\n" +
                        "\n" +
                        "7 فقدان الوعي.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "إذا كان المصاب فاقدا لوعيه\n" +
                        "\n" +
                        "1 تأكد من أن مجرى الهواء مفتوحا.\n" +
                        "\n" +
                        "2 إذا كان المصاب يتقيأ , إجعله يستلقى ممددا على جانبه لتجنب رجوع القيء إلى فمه\n" +
                        "\n" +
                        "3 أسرع بعد ذلك في الاتصال بالطوارئ\n" +
                        "\n" +
                        "إذا لم يفقد المصاب وعيه و ظهرت عليه علامات السكتة الدماغية\n" +
                        "\n" +
                        "1 اتصل بقسم الطوارئ فورا.\n" +
                        "\n" +
                        "2 قم بعد ذلك بطمأنة المصاب و ساعده على التمدد على الجانب الذي يريحه أكثر.\n" +
                        "\n" +
                        "3 لا تعطه أي طعام أو شراب.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "في المراحل الأولى للغيبوبة\n" +
                        "\n" +
                        "1 عمل حقنة شرجية للمريض كل 6 ساعات\n" +
                        "\n" +
                        "2 استخدام شراب اللاكتيلوز بمعدل 2 ملعقة كبيرة كل 8 ساعات.\n" +
                        "\n" +
                        "3 استخدام أقراص النيوميسن بمعدل 2 قرص كل 8 ساعات.\n" +
                        "\n" +
                        "4 إيقاف تناول أدوية مدرات البول.\n" +
                        "\n" +
                        "5 منع تناول الأطعمة الغنية بالبروتينات الحيوانية في تغذية المريض.\n" +
                        "\n" +
                        "فى حالة الغيبوبة الشديدة :\n" +
                        "\n" +
                        "يجب نقل المريض للمستشفى حيث أن المريض فى هذه الحالة يحتاج لرعاية طبية و تمريضية خاصة ، و أيضا لمعرفة سبب الغيبوبة حيث أن بعض حالات الغيبوبة قد تكون مصحوبة بنزيف داخلي من دوالي المريء.\n" +
                        "\n" +
                        "\n" +
                        "*حالات الحروق\n" +
                        "الحروق هى عبارة عن إزالة الجلد عن جزء من الجسم بأحد الوسائل التالية:\n" +
                        "\n" +
                        "1 الحرارة الجافة : مثل الحديد الساخن أو فرن الطبخ.\n" +
                        "\n" +
                        "2 الكهرباء : مثل الصدمةأو الصعقة الكهربائية.\n" +
                        "\n" +
                        "3 الاحتكاك : مثل من يمسك بحبلُيشد من يده بقوه .\n" +
                        "\n" +
                        "4 الأحماض : منظفات الحمام أو الأفران.\n" +
                        "\n" +
                        "5 القلويات : مثل الجير الحى.\n" +
                        "\n" +
                        "6 الإشعاعات : مثل حالات العلاج بجرعات كبيرة من الأشعة السينية أو أشعة الشمس الحارقة (الأشعة فوق البنفسجية).\n" +
                        "\n" +
                        "7 الحرارة الرطبة : مثل الماء المغلي أو البخار.\n" +
                        "\n" +
                        "وظيفة الجلد الفسيولوجية\n" +
                        "خلق الله سبحانه و تعالى الجلد ليؤدى وظائف عديدة من أهمها :\n" +
                        "\n" +
                        "1 تنظيم الحرارة\n" +
                        "\n" +
                        "2 عزل الجسم عن المحيط الخارجي و المحافظة على السوائل داخله.\n" +
                        "\n" +
                        "3 حماية الجسم من العوامل الخارجية الضارة.\n" +
                        "\n" +
                        "كما رأينا ، تختلف أسباب الحروق من الجافة إلى الباردة ، فهي قد تنتج عن التعرض للّهب أو لأشعة الشمس الحامية أو المواد الكيميائية أو الكهرباء أو السوائل المغلية أو البخار إلا أن جميعهاُيعامل معاملة واحدة ، و تقسم الحروق حسب عمق الحرق و إلى مساحات.\n" +
                        "\n" +
                        "كقاعدة عامة : عند زيادة الحروق عن 90 % من مساحة الجسم لابد من معالجتها بالمستشفى.\n" +
                        "\n" +
                        "درجات الحروق\n" +
                        "تأتي الحروق على ثلاث درجات من الشدة و الجسامة :\n" +
                        "\n" +
                        "1 حروق الدرجة الأولى : و يأتي في نطاقها معظم الحروق الشمسية و حروق المطبخ , و هي لا تؤثر إلا على الطبقة الخارجية للجلد ، و هى حروق تسبب ألماً و إحمراراً.\n" +
                        "\n" +
                        "2 حروق الدرجة الثانية : فتسبب تلف الجلد الخارجي و الداخلي و تحدث فقاعات ، و بالرغم من شدة الألم الذي يسببه هذا النوع من الحروق إلا أنه عادة ليس خطيراً ، إلا إذا كان يشمل منطقة واسعة من الجلد , أو إذا لحقه تلوث جرثومي و التهاب\n" +
                        "\n" +
                        "3 حروق الدرجة الثالثة : و هذه دائماً حروق خطيرة فهي تدّمر الجلد الخارجي و الداخلي , و كذلك تحرق الشعر و الأعصاب و الأوعية الدموية و الغدد و الشحم , بل و قد تصل أحياناً إلى العضلات و العظام ، و تبدو حروق الدرجة الثالثة بيضاء اللون أو مسودّة , و هي تكون عادة محاطة بحروق الدرجتين الأولى و الثانية ، وإذا كانت تشمل منطقة واسعة من الجسم , فإنها يمكن أن تكون قاتلة.\n" +
                        "\n" +
                        "كيف يمكن حساب مساحة الحروق ؟\n" +
                        "تمثل الأجزاء المختلفة للجسم مساحة تعادل نسبة مئوية كالأتى :\n" +
                        "\n" +
                        "- الرأس و الرقبة 9.%\n" +
                        "\n" +
                        "- كل طرف علوى 9.%\n" +
                        "\n" +
                        "- كل طرف سفلى 18.%\n" +
                        "\n" +
                        "- مقدمة الصدر و البطن 18.%\n" +
                        "\n" +
                        "- الظهر و منطقة الفخدين 18.%\n" +
                        "\n" +
                        "- منطقة الأعضاء الجنسية 1.%\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "- تختلف مظاهر الحرق و أعراضه حسب الحرق من إحمرار إلى تورم إلى تكوين فقاقيع إلى احتراق كامل لبعض أو لكل طبقات الجلد.\n" +
                        "\n" +
                        "- هذا بالإضافة إلى الآلام الشديدة المصاحبة للحروق.\n" +
                        "\n" +
                        "- قد يتعرض المريض لصدمة عصبية نتيجة شدة الألم أو صدمة بالجهاز الدورى نتيجة فقد كمية كبيرة من السوائل عند تكوين الفقاقيع.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "الحروق البسيطة دون فقاعات\n" +
                        "\n" +
                        "1 أغسل مكان الحرق بماء بارد جارى لا يكون شديد الاندفاع.\n" +
                        "\n" +
                        "2 إنزع أى شىء ضيق مثل الخواتم أو ما شابه ذلك قبل حدوث تورم و صعوبة نزعها فيما بعد.\n" +
                        "\n" +
                        "3 ثم قم بتغطية الحرق بقطعة قماش طرية و مبللة بماء بارد حتى يزول الألم (غالبا ما تكفي مدة خمسة عشر دقيقة لزوال الألم).\n" +
                        "\n" +
                        "4 أو قم بلف مكعبات من الثلج بقماش نظيف بصورة كّمادة و توضع فوق المنطقة المصابة لمدة عشرين دقيقة ، ثم ترفع لمدة عشرة دقائق قبل أن يعاد وضعها كالسابق , و هكذا تستمر الدورة ، و يجب تفادي وضع الثلج مباشرة على الجلد أو إبقاء الكمادة الثلجية فوق المكان المحروق أكثر من عشرين دقيقة لأن ذلك قد يسبب ما يسم بعضة الصقيع.\n" +
                        "\n" +
                        "5 لا تحاول استعمال العلاجات المنزلية أو كمادات الثلج إذا كانت حروق الدرجتين الأولى و الثانية تغطى مساحة أكبر من مساحة خمسة كفوف لأن وضع كمادات ثلجية على مثل هذه المساحة الكبيرة يمكن أن يسبب نقص حرارة الجسم ما قد يهدد الحياة ، بدلاً من ذلك اطلب العون الطبي بأسرع ما يمكن.\n" +
                        "\n" +
                        "6 عندما يخف الألم ضع على الحرق مرهم أو كريم خاص بالحروق مثل كريم درمازين Dermazin.\n" +
                        "\n" +
                        "الحروق المترافقة بالفقاعات\n" +
                        "\n" +
                        "1 أغسل مكان الحرق بماء بارد و لا تخرب الفقاعات\n" +
                        "\n" +
                        "2 ثم اتصل بالطبيب.\n" +
                        "\n" +
                        "3 لا تحاول نزع الملابس إذا كانت قد التصقت\n" +
                        "\n" +
                        "4 لا تغطي الحرق\n" +
                        "\n" +
                        "5 كل حرق في الوجه أو اليدين أو القدمين أو الأعضاء التناسلية يجب أن يتم مشاهدته من قبل الطبيب في أقرب وقت.\n" +
                        "\n" +
                        "الحروق الكبيرة أو العميقة\n" +
                        "\n" +
                        "1 قم بإبعاد المصاب عن مصدر الحرق فورا\n" +
                        "\n" +
                        "2 اتصل بالإسعاف مباشرة أو قم بإسعاف المصاب بنفسك و ريثما يحضر الإسعاف قم بإزالة كافة الألبسة من على جسم المصاب.\n" +
                        "\n" +
                        "3 لا تقم بوضع أية أدوية أو مراهم أو مواد منزلية على الحرق.\n" +
                        "\n" +
                        "4 يمكن تغطية المنطقة المصابة بقماش نظيف لإبعاد الهواء عنها حتى تأتى الإسعاف.\n" +
                        "\n" +
                        "الحروق الكهربائية\n" +
                        "\n" +
                        "1 فصل مصدر الكهرباء أولا.\n" +
                        "\n" +
                        "2 لا تحاول لمس المصاب بيدك المجردة و لكن حاول إبعاده عن مصدر الكهرباء بقطعة خشب جافة أو بقطعة قماش سميكة و جافة.\n" +
                        "\n" +
                        "3 غط مكان الحرق بضمادة جافة معقمة.\n" +
                        "\n" +
                        "4 لا تستعمل الماء أو الثلج لتهدئة الجرح\n" +
                        "\n" +
                        "5 بعد ذلك يجب أن تذهب للطبيب ليرى ما يلزم.\n" +
                        "\n" +
                        "الحروق الناتجة المواد كيماوية\n" +
                        "\n" +
                        "1 قم بغسل مكان الإصابة بالماء الجارى النظيف لمدة لا تقل عن ربع ساعة.\n" +
                        "\n" +
                        "2 يجب نزع الملابس الملوثة بالمواد الكيماوية حتى لا تستمر حالة الحروق .\n" +
                        "\n" +
                        "3 فى حالة حدوث حرق بالفم و الحلق نتيجة مواد كيميائية أو سائل ساخن يعطى المصاب جرعات قليلة من الماء البارد على فترات متكررة و ينزع أى ملابس ضيقة أوُحلى على الرقبة أو الصدر ، و إن تواجد طحينة أو نشا ينصح بشربها.\n" +
                        "\n" +
                        "4 بعد ذلك يجب أن تذهب للطبيب ليرى ما يلزم.\n" +
                        "\n" +
                        "5 ملاحظات هامة :\n" +
                        "\n" +
                        "- إذا كان المصاب سيتم نقله للطبيب فلا يوضع أى شىء على الحروق ، و احذر وضع ما هو شائع بالخطأ مثل (البيض و الزهرة و معجون الأسنان و ما شابه ذلك) ، فقط يغطى بالفازلين إن وجد.\n" +
                        "\n" +
                        "- ممنوع منًعا باتا فقأ الفقاقيع أو إزالة الجلد المحروق أو التخلص من السائل الناتج عن الحروق.\n" +
                        "\n" +
                        "- إذا كانت المنطقة المصابة صغيرة و سيتم معالجتها دون نقله إلى المستشفى أو الطبيب فقم بعمل التالى :\n" +
                        "\n" +
                        "1 أعد غسيل الجرح بمحلول ملح أو مطهر.\n" +
                        "\n" +
                        "2 ضع طبقة من مرهم الحروق على قطعة من الشاش ثم ضع الشاشة على المنطقة المصابة ثم طبقة من القطن ثم لف المنطقة المصابة و يعطى مضاد حيوى.\n" +
                        "\n" +
                        "3 يعطى المصاب حقنة تيتانوس ، لاحظ أن بقاء الحرق مكشوف يعرضه للإصابة بالتلوث بالجراثيم.\n" +
                        "\n" +
                        "4 هتم بإعطاء المصاب كمية وفيرة من العصائر أو الماء.\n" +
                        "\n" +
                        "الحروق الشمسية\n" +
                        "\n" +
                        "تحدث الحروق الشمسية نتيجة التعرض لكميات كبيرة من أشعة الشمس الضارة (الأشعة فوق البنفسجية) و التى تسبب احمرار الجلد و سخونته و تورّم و تقرّح و تحسس بالألم عند اللمس.\n" +
                        "\n" +
                        "بعض حالات الحروق الشمسية الشديدة تحدث آلاماً و صداعاً بل و غثياناً ، و يتم الإسعاف كما يلى :\n" +
                        "\n" +
                        "1 الإبعاد عن أشعة الشمس.\n" +
                        "\n" +
                        "2 أخذ حمام بارد.\n" +
                        "\n" +
                        "3 ثم يدهن الجلد بالهلام المسكن و يرش بالرذاذ المصنوع خصيصاً للقضاء على التورم و تبريد الجلد\n" +
                        "\n" +
                        "4 قد تستعمل المسكنات لتخفيف الالتهاب و تسكين الألم.\n" +
                        "\n" +
                        "5 إذا لوحظ تفاعل جسماني محدثاً قصور تنفس و إعياء شديداً و غثياناً و قيئ ، كما أن تقرحاً شديداً أو حرقاً شمسياً لمنطقة حساسة من الجسم , يستوجبان مراجعة الطبيب فورا.\n" +
                        "\n" +
                        "*حالة دخول جسم غريب فى العين\n" +
                        "في حالات قليلة قد يدخل رمش أو تدخل ذرة من وسخ في العين فتسبب تهيجا بها.\n" +
                        "\n" +
                        "فإذا لم تغسلها دموع العين التي تسيل حينئذ ، فإنه يمكن في بعض الحالات إزالتها بجذب الجفن العلوي إلى أسفل بحيث يحتك بالحفن السفلي برفق ، و ذلك لكي تتخلص رموش الجفن السفلي من أي جسم غريب محتجز تحت الجفن العلوي.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "إذا لم يفلح هذا فجرب أي من الخطوات التالية :\n" +
                        "\n" +
                        "الطريقة الأولى 1 ضع ماسحة قطنية (عود عند طرفه قطعة قطن) خلف الجفن العلوي.\n" +
                        "\n" +
                        "2 مستخدما أطراف أصابعك حاول برفق رفع الجفن العلوى جاعلا ذلك الجفن ينقلب فوق الماسحة القطنية.\n" +
                        "\n" +
                        "3 إذا تمكنت من رؤية هذا الجسم الغريب فقم بإزالته باستخدام ماسحة قطنية أخرى مبتلة أو بقطعة من ورق التواليت المبتل.\n" +
                        "\n" +
                        "الطريقة الثانية 1 أمل رأس الشخص المصاب إلى أحد الجانبين.\n" +
                        "\n" +
                        "2 اجعل عينه مفتوحة جيدا بالمباعدة بين جفني العين بإصبعين من أصابعك.\n" +
                        "\n" +
                        "3 استخدم قطارة للعين أو كوبا من الماء لتغسل العين بعناية من جهة الأنف إلى الجهة الخارجية.\n" +
                        "\n" +
                        "إذا لم يتيسر التخلص من هذا الجسم الغريب فقم بتغطية العين بضمادة من الشاش و أذهب إلى الطبيب.\n" +
                        "\n" +
                        "إذا تعرضت العين لأي مادة كيماوية 1 قم بغسل العين بماء نظيف و بشكل متكرر و لمدة خمسة عشر دقيقة على الأقل.\n" +
                        "\n" +
                        "2 لا تحاول لمس أو تدليك العين المتأذية و لا تضع أية قطرة عينية إلا باستشارة الطبيب.\n" +
                        "\n" +
                        "3 ثم اتصل بالطبيب أو بمركز السموم.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "*عضة الثعبان\n" +
                        "عضات الثعابين نادرا ما تؤدي إلى الوفاة حتى و إن كانت الثعابين سامة , و معظم الوفيات تحدث بسبب الحساسية لدى المصاب أو ضعف نظام المناعة أو لتأخر المصاب في تلقي العناية الطبية.\n" +
                        "\n" +
                        "يوجد ما يقرب من 14 عائلة من الثعابين منها خمسة أنواع سامة ، و تختلف الجرعة السامة من ثعبان لآخر و لكن حوالي 20 %من اللدغات تكون جافة و لا يوجد بها المادة السامة.\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "هناك أعراض موضعية تحدث عادة في مكان اللدغة :\n" +
                        "\n" +
                        "1 عبارة عن التهابات و تهتكات تحدث في مكان اللدغة (احمرار و تورم و نزيف تحت الجلد)\n" +
                        "\n" +
                        "عراض أخرى تحدث في أماكن بعيدة عن اللدغة أو عن العضة ، و منها :\n" +
                        "\n" +
                        "1 غثيان و قيء.\n" +
                        "\n" +
                        "2 ضعف عام مع الانقباض المفاجئ و السريع لبعض العضلات.\n" +
                        "\n" +
                        "3 تعرق كثيف مع زيادة فى إفراز اللعاب.\n" +
                        "\n" +
                        "4 خمول و ازدواجية في الرؤية.\n" +
                        "\n" +
                        "5 هبوط في ضغط الدم مع توقف مفاجئ للقلب قد يحدث.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "1 أطلب الإسعاف.\n" +
                        "\n" +
                        "2 هدئ من روع المصاب لنع انتشار السم في الجسم.\n" +
                        "\n" +
                        "3 اغسل الجرح بالماء الجارى و الصابون إن أمكن ذلك.\n" +
                        "\n" +
                        "4 حاول تثبيت الجزء المصاب أفقيا مع عمل ضمادة لكامل العضو المصاب ، كما يجب إبقاء مكان العضة أدنى من مستوى القلب لإبطاء انتشار السم.\n" +
                        "\n" +
                        "5 قم بحمل المصاب إلى قسم الطوارئ أو اطلب منه المشي ببطء حتى لا ينتشر السم فى دمه حتى تصل إلى أقرب مستشفى.\n" +
                        "\n" +
                        "6 يمكن عمل رباط ضاغط لربط الجزء السابق للإصابة لتمنع انتشار السم إلى بقية أجزاء الجسم.\n" +
                        "\n" +
                        "7 لا تضع الثلج على مكان الإصابة فهذا لا يفيد في منع انتشار السم.\n" +
                        "\n" +
                        "8 لا تقدم للمصاب أي سوائل أو أطعمة أو الأسبرين لأنه من الممكن أن يغمى عليه و يتقيأ ما تناوله فيدخل القيىء مجارى التنفس و يسبب اختناقه.\n" +
                        "\n" +
                        "9 إذا فقد المصاب وعيه فلا تضيع الوقت فى محاولة إفاقته لأنه لن يستجيب ، و إعمل على نقله لأقرب مستشفى فورا.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "*لسعة قنديل البحر\n" +
                        "\n" +
                        "يصنف قنديل البحر من الرخويات البحرية ، يمتلك سماً يوجد فى أكياس صغيرة جدا كبالون ماء ، كل كيس منها يحتوى على شريط قاذف فيه أشواك تخترق جسم الإنسان عند أي ملامسة.\n" +
                        "\n" +
                        "يحتوي السم على مركبات كيميائية كثيرة و تتضمن سموم عصبية عضلية و هى مركبات تشبه الهيستامين.\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "\n" +
                        "هناك أعراض موضعية تحدث عادة في مكان اللدغة :\n" +
                        "\n" +
                        "عبارة عن التهابات و تهتكات تحدث في مكان اللسعة (احمرار و تورم و نزيف تحت الجلد).\n" +
                        "\n" +
                        "أعراض أخرى تحدث في أماكن بعيدة عن اللدغة أو عن العضة ، و منها :\n" +
                        "\n" +
                        "1 غثيان و قيء.\n" +
                        "\n" +
                        "2 ضعف عام مع الانقباض المفاجئ و السريع لبعض العضلات.\n" +
                        "\n" +
                        "3 قد يعانى المصاب من آلام فى البطن و إسهال.\n" +
                        "\n" +
                        "4 هبوط في ضغط الدم.\n" +
                        "\n" +
                        "5 شحوب فى البشرة مع تعرق غزير.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "\n" +
                        "1 يجب تجنب الحك أو الخدش أو أي حركة قد تؤدي إلى كسر الأشواك السمية فى موضع اللسعة\n" +
                        "\n" +
                        "2 لا تغسل المناطق المصابة بماء عادي , و إنما أغسلها بماء البحر البارد أو الماء المالح.\n" +
                        "\n" +
                        "3 تغمر المنطقة المصابة بالخل مدة 30 دقيقة لنزع الأشواك.\n" +
                        "\n" +
                        "4 توجه إلى أقرب مركز لعلاج السموم\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "* إلتواء المفاصل\n" +
                        "إلتواء المفاصل هو إصابة رباط المفصل أو وتر العضل القريب من المفصل.\n" +
                        "\n" +
                        "أنواع المفاصل :\n" +
                        "\n" +
                        "مفصل ثابت كما في الحوض و الجمجمة.\n" +
                        "\n" +
                        "مفصل مفصلي الحركة مثل الكوع و الركبة.\n" +
                        "\n" +
                        "مفصل محوري الحركة مثل الورك و الكتف.\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "تحدث التشنجات (نوبات الصرع) لأسباب كثيرة منها جروح الرأس و السموم و الالتهابات و الحميات العالية و تسمم الحمل ، كما تحدث تماما في الصرع و تكون مصحوبة بنوع من العنف يعقبها فقدان للوعي.\n" +
                        "\n" +
                        "قد تتصلب العضلات لعدة ثواني أو لمدة نصف دقيقة يتبعها حركات اهتزازية و رغوة زبدية من الفم أو لعاب سائل ، و تستمر الحالة في الهدوء إلى أن تخف تماما\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "كيف يبدو المفصل الملتوى ؟\n" +
                        "\n" +
                        "1 انتفاخ و تورم فى المنطقة المصابة و وجع عند لمسها.\n" +
                        "\n" +
                        "2 الألم الشديد عند تحريك المفصل المصاب.\n" +
                        "\n" +
                        "3 تغير لون الجلد فوق المفصل بالإحمرار أو الزرقة\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "1 ضع ثلج أو كمادة باردة فوق المفصل المصاب لتخفيف الألم و الورم.\n" +
                        "\n" +
                        "2 ثبت المفاصل برباط عريض و مخدة\n" +
                        "\n" +
                        "3 ضع وسادة أو أى شىء تحت رأسه يحميها من الارتطام بالأرض أثناء النوبة.\n" +
                        "\n" +
                        "4 فك ملابس المصاب الضيقة من صدره و عنقه لتسهل تنفسه\n" +
                        "\n" +
                        "5 بعد انتهاء نوبة الصرع يوضع المصاب ممددا على جانبه لتجنب رجوع القيء إلى فمه إن وجد و ذلك للمحافظة على سلامة الممر الهوائي.\n" +
                        "\n" +
                        "6 إذا توقف تنفس المصاب يعمل له تنفس صناعي من الفم إلى الفم (إذا تعذر فتح الفم يعمل له تنفس من الفم إلى الأنف).\n" +
                        "\n" +
                        "7 قد يكون المصاب عرضة للإصابة بنوبة أخرى إذا بذل مجهودا أو تمشى بعد النوبة الأولى.\n" +
                        "\n" +
                        "8 اسع لتوفير راحة و هدوء المصاب.\n" +
                        "\n" +
                        "9 لا تزعج المصاب أو تحركه أو تسأله.\n" +
                        "\n" +
                        "10 يتم استدعاء النجدة الطبية فى الحالات التالية فقط :\n" +
                        "\n" +
                        "- إذا كان المريض يصاب بهذه النوبة لأول مرة.\n" +
                        "\n" +
                        "- إذا استمرت النوبة أكثر من خمس دقائق أو تكررت أكثر من مرة بشكل متوالى.\n" +
                        "\n" +
                        "- إذا حدثت و المريض فى الماء (كالبحر أو حمام السباحة).\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "* أزمة الربو\n" +
                        "\n" +
                        "الربو الشعبي هو مرض صدري مزمن تصاب به الرئتين حيث تضيق فيه مجاري الهواء التي تحمل الهواء من و إلى الرئة و بالتالي يصعب التنفس.\n" +
                        "\n" +
                        "مجاري الهواء في الشخص المصاب بالربو تكون شديدة الحساسية لعوامل معينة تسمى المهيجات ، و عند إثارتها بهذه المهيجات تلتهب مجاري الهواء و تنتفخ و يزيد إفرازها للمخاط و تنقبض عضلاتها و يؤدي ذلك إلى إعاقة التدفق العادي للهواء ، و هذا ما يسمى بأزمة الربو.\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "\n" +
                        "1 ضيق و صعوبة في التنفس و تعثر في الكلام.\n" +
                        "\n" +
                        "2 الزفير يكون أطول من الشهيق مع صعوبة أثناء الزفير.\n" +
                        "\n" +
                        "3 سرعة في النبض.\n" +
                        "\n" +
                        "4 الشعور بالقلق و الخوف مع تعثر الكلام.\n" +
                        "\n" +
                        "5 ازرقاق البشرة و خاصة الوجه مع تعرق كثيف.\n" +
                        "\n" +
                        "6 هيجان فى الصدر و سعال شديد.\n" +
                        "\n" +
                        "7 حدوث امتلاء في الأوردة العنقية.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "\n" +
                        "1 التخفيف عن المصاب و تهدئته و التحدث معه.\n" +
                        "\n" +
                        "2 جلوس المصاب مع مّد رجليه و استناد الجزء العلوي من الجسم على يديه خلف جسمه.\n" +
                        "\n" +
                        "3 خلع الملابس الضيقة لتسهيل عملية التنفس.\n" +
                        "\n" +
                        "4 يعطى المصاب بخاخ فنتولين Ventolin.\n" +
                        "\n" +
                        "5 إذا لم تتحسن الحالة ينقل المريض إلى المستشفى لاستنشاق الأكسجين و إعطائه محاليل وريدية.\n" +
                        "\n" +
                        "\n" +
                        "نوبات الصرع أو التشنجات\n" +
                        "\n" +
                        "الصرع هو حالة مرضية عادية تتميز بمجموعة اضطرا بات مؤقتة في وظيفة المخ مصحوبة بتشنجات و فقدان للوعي.\n" +
                        "\n" +
                        "يجب أن يعرف الجميع أن المصاب بالصرع ليس مخبولا و غير مؤذي و غير مخيف , و ليس مصابا بمس شيطاني كما يعتقد البعض ، كما أن معظم حالات الصرع تستجيب للعلاج.\n" +
                        "\n" +
                        "* نوبات الصرع\n" +
                        "\n" +
                        "تحدث التشنجات (نوبات الصرع) لأسباب كثيرة منها جروح الرأس و السموم و الالتهابات و الحميات العالية و تسمم الحمل ، كما تحدث تماما في الصرع و تكون مصحوبة بنوع من العنف يعقبها فقدان للوعي.\n" +
                        "\n" +
                        "قد تتصلب العضلات لعدة ثواني أو لمدة نصف دقيقة يتبعها حركات اهتزازية و رغوة زبدية من الفم أو لعاب سائل ، و تستمر الحالة في الهدوء إلى أن تخف تماما\n" +
                        "\n" +
                        "الأعراض و العلامات العامة\n" +
                        "\n" +
                        "تصبح شفتا المصاب زرقاء , و تتقلب عيناه إلى أعلى و يسقط رأسه إلى الخلف ويهتز جسده بتقلصات لا يستطيع التحكم فيها.\n" +
                        "\n" +
                        "بعض الأشخاص ينتابهم شعور و إحساس خاص قبل حدوث الحالة مثل رؤية أشياء لا وجود لها , أو سماع أصوات غريبة , أو تذوق أو شم أشياء غريبة , أو الشعور بالحاجة إلى الانتقال إلى مكان آمن.\n" +
                        "\n" +
                        "الإسعافات الأولية\n" +
                        "\n" +
                        "1 لا تقيد المصاب إن كان في حالة تشنجات (لا تحاول كبح حركاته التشنجية) بل إعمل على وقايته من الإصابات و ذلك بإبعاد الأشياء المؤذية من حوله أثناء النوبة مثل الأثاث.\n" +
                        "\n" +
                        "2 لا تضع أي شيء في فم المصاب أو بين أسنانه.\n" +
                        "\n" +
                        "3 ضع وسادة أو أى شىء تحت رأسه يحميها من الارتطام بالأرض أثناء النوبة.\n" +
                        "\n" +
                        "4 فك ملابس المصاب الضيقة من صدره و عنقه لتسهل تنفسه\n" +
                        "\n" +
                        "5 بعد انتهاء نوبة الصرع يوضع المصاب ممددا على جانبه لتجنب رجوع القيء إلى فمه إن وجد و ذلك للمحافظة على سلامة الممر الهوائي.\n" +
                        "\n" +
                        "6 إذا توقف تنفس المصاب يعمل له تنفس صناعي من الفم إلى الفم (إذا تعذر فتح الفم يعمل له تنفس من الفم إلى الأنف).\n" +
                        "\n" +
                        "7 قد يكون المصاب عرضة للإصابة بنوبة أخرى إذا بذل مجهودا أو تمشى بعد النوبة الأولى.\n" +
                        "\n" +
                        "8 اسع لتوفير راحة و هدوء المصاب.\n" +
                        "\n" +
                        "9 لا تزعج المصاب أو تحركه أو تسأله.\n" +
                        "\n" +
                        "10 يتم استدعاء النجدة الطبية فى الحالات التالية فقط :\n" +
                        "\n" +
                        "- إذا كان المريض يصاب بهذه النوبة لأول مرة.\n" +
                        "\n" +
                        "- إذا استمرت النوبة أكثر من خمس دقائق أو تكررت أكثر من مرة بشكل متوالى.\n" +
                        "\n" +
                        "- إذا حدثت و المريض فى الماء (كالبحر أو حمام السباحة).", fontSize = 16.sp, color = Color.Gray, modifier = Modifier
                    .fillMaxWidth()
                    .padding(16.dp))
            }
        }
    }
}